function txtchange1(){document.getElementById('txt1').innerHTML ='総合運　★★★★☆';
                     document.getElementById('text-container').innerHTML ='2024年上半期は現実思考でコツコツと、下半期はオープン＆アクティブをテーマに。
準備や計画をしっかりとすると、のびのび動きやすい環境が整うよ。自己主張はしっかりとしてみて。思い切った発言をきっかけに、面白い展開が生まれるはず♩
秋は、春から積み上げたものが形になる季節なので、がんばった分だけうれしい手応えを掴めそう。とはいえ、サボってしまうとツケが回ってくるので要注意。すべては自分次第と考えて、適当な考え方や行動は控えよう！';}
function txtchange2(){document.getElementById('txt1').innerHTML ='総合運　★★★★★';
                       document.getElementById('text-container').innerHTML ='2024年は、ロケットスタートでチャンスを掴める年。
やりたいことがある人は、上半期でやり尽くすつもりでアクティブに行動しよう。行動した分だけ、チャンスが巡ってくるはず！
ゴールデンウィークは、新しいことを始めるのに良いタイミング。何となくでスタートさせたとしても、行き当たりばったりにならず堅実な進展が期待できそう。
秋から冬にかけては、意識が外向きになりやすく大忙しに。セルフケアをしっかりして、自分を大切にしてね♡';}
function txtchange3(){document.getElementById('txt1').innerHTML ='総合運　★★★★★';
                       document.getElementById('text-container').innerHTML ='2024年はスロースタートですが、梅雨ごろから運気がグングン右肩上がりに！ 新しいことにチャレンジしたり、ずっと温めていた計画を実行したりするとGOOD。
6月から10月は、アクティブに動いてチャンスを掴める時期。ただ、周囲のアドバイスに惑わされる可能性が。親しい友人の助言でも、自分の可能性を狭める意見なら話半分に聞いておいた方が良さそう。何となくでも確信があるなら大丈夫。自分を信じてトライしよう♩';}
function txtchange4(){document.getElementById('txt1').innerHTML ='総合運　★★★☆☆';
                       document.getElementById('text-container').innerHTML ='上半期は人間関係が盛り上がって、人脈を広げるのに良い時期。にぎやかなイベントでも楽しく過ごせるので、人の集まる場所には積極的に顔を出してみよう♩
下半期は自分と向き合う場面が多く、「あのときのアレが今活かされている」とハッとするかも。以前はあまり価値を見出せなかったことがプラスになっているのに気づき、過去の自分に感謝したくなるはず！
6月と7月は、一対一の関係に注目を。恋愛でも仕事でも、自分にとって大切な人がハッキリするかも。';}
function txtchange5(){document.getElementById('txt1').innerHTML ='総合運　★★★★☆';
                       document.getElementById('text-container').innerHTML ='2024年は意識が外に向きやすく、プライベート＜仕事、自分＜他人になりそう。でも、周囲に対して存在感をしっかり示すには良い時期なので、やりたいことがある人は徹底的に勝ちを狙って！ 妥協や忖度はしなくてOK。自分が主役と思って堂々とチャレンジしよう！
チャンスの時期は、1月下旬と8月。特に夏は、仲間と一緒に充実した時間が過ごせそう。視野を広げてアクティブに行動すると、幸運を掴めるはず♩';}
function txtchange6(){document.getElementById('txt1').innerHTML ='総合運　★★★☆☆';
                       document.getElementById('text-container').innerHTML ='上半期は、あちこち出向いて視野を広げるのがGOOD。毎日、家と職場の往復をするだけの人は、マンネリ化した日常から一歩踏み出すことが大切だよ。普段あまり行かない街に出かけたり、人が集まる場所に顔を出してみると、新鮮な発見があるはず！
下半期は、これまでの経験を踏まえて行動を起こしてみよう。自分の方向性が決まりやすく、新しい目標が見つかるかも。
仕事でも趣味でも、やりたいことがある人には追い風が吹くのでがんばって♩';}
function txtchange7(){document.getElementById('txt1').innerHTML ='総合運　★★★★☆';
                      document.getElementById('text-container').innerHTML ='人からのお誘いが幸運を掴むきっかけに！ 周りから声をかけられたら前向きに応えてみて。6月以降は、あまりなじみのない場所にも積極的に足を運ぶのがオススメ。
行ってみたいところがある人は、先送りしないで今すぐ行く準備を。会えたらいいなと思う人には、自分からコンタクトを取って。思わぬチャンスを手に入れることができるはず♩
2024年は変化の年。アクティブになるほど、きっと新しい自分に出会えるよ！';}
function txtchange8(){document.getElementById('txt1').innerHTML ='総合運　★★★★☆';
                       document.getElementById('text-container').innerHTML ='2024年は、大切な人と確かな絆を結ぶ年。好きな人はもちろん、仕事でお世話になる人など、自分にとってかけがえのないキーパーソンが現れるはず♡
同じ毎日の繰り返しが、見違えるほどドラマティックに変わる予感も。すでに心当たりがある人は、相手とじっくり関係を深めてみてね！
下半期には、幸運を運んでくれる人も登場しそう。声をかけられたら、忙しくてもやさしく対応を。柔軟に応じると思わぬチャンスを掴めるかも♩';}
function txtchange9(){document.getElementById('txt1').innerHTML ='総合運　★★★☆☆';
                       document.getElementById('text-container').innerHTML ='上半期は、半径5メートル以内の身近な世界を見直す時期。夜更かしや深酒でライフスタイルが崩れているなら大胆に改善を！ 毎日を楽しくするカギは、らしくないと感じる習慣を取り入れることにあるよ。キレイな自分を作るヒントは、意外なところに隠れているはず♩
下半期は、一対一の人間関係に注目。運命の人と呼べるキーパーソンに出会える予感が！ 恋愛でも仕事でも、自分に絶対必要と思える人物が現れるよ♡';}
function txtchange10(){document.getElementById('txt1').innerHTML ='総合運　★★★★☆';
                        document.getElementById('text-container').innerHTML ='2024年は、恋に仕事に大忙し！ チャンスは多いので、心の感度を上げて取りこぼさないようにしよう。上半期は恋愛、下半期は仕事に意識を向けるとGOOD。
チャンスを掴みやすいのは6月と7月。これまでがんばってきたことが、結果となって現れるはず。以前諦めたことに再トライすることで、自分に自信をつけられる＆なりたい自分になれるかも♩';}
function txtchange11(){document.getElementById('txt1').innerHTML ='総合運　★★★☆☆';
                        document.getElementById('text-container').innerHTML ='2024年はゆるやかにスタート。まずは、自分の生活を整えることを大切に。引っ越しや部屋の模様替えは、先延ばしにしないで計画的に進めるといいかも。実家住まいで一人暮らしをしたい人は、5月までに動くのがベスト。
下半期は、“好き”のエネルギーがグッとアップ！ 恋愛はもちろん、好きなことや得意分野での活躍が期待できるよ。やらなければいけないことよりやりたいことを重視して。趣味が仕事や副業になる可能性も♩';}
function txtchange12(){document.getElementById('txt1').innerHTML ='総合運　★★★☆☆';
                        document.getElementById('text-container').innerHTML ='2024年は自立心が刺激される年。自分で考えて決断しなければならない場面が多くなりそう。ただ、情報収集や意見交換はスムーズにできるので、判断材料には困らないはず！ 何事も一つひとつ丁寧に片付けていくと、心地良い状態になるよ。
下半期は、自分が安心できる居場所が見つかる時期。引っ越しでは、具体的な計画を立てることで、条件の良い物件を見つけられるはず！
家族や身内と呼べる友人とは、よりいっそう仲良しになれる予感♩';}
